# @version : 1.0
# @Author  : 混江龙
# @File    : arithmetic.py
# @Time    : 2025/8/16 22:00
# 运算符演示

# 除号，返回的是小数
print(10 / 3)

# 取整除，返回的是整数
print(10 // 3)
print(-10 // 3)
print(-9 // 2)

# 当对一个数取模时，对应的运算公式是：a%b = a-a//b*b
print(-10 % 3)  # 计算 -10 - （-10）//3*3 => -10 - (-4)*3 =>-10 -(-12) => 2
print(10 % -3)  # 计算 10 -10//(-3)*(-3) => 10 - (-4)*(-3) => 10-12 => -2

# 假如还有97天放假，问：合多少个星期零多少天？
days = 97
week = days // 7
left_day = days % 7
print(f"假如还有{days}天放假，则合{week}个星期零{left_day}天")

# 华氏温度转摄氏温度的公式：5/9*（华氏温度-100），求234.5华氏温度是多少摄氏度？
a = 234.5
b = 5 / 9 * (a - 100)
print(f"{a}华氏度={b}摄氏度")
print("%.2f华氏度=%.2f摄氏度" % (a, b))
